eisup_2019_docmng_integration/src/Documents/абс_ПередачаОСМеждуФиллиалами/абс_ПередачаОСМеждуФиллиалами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПередачаОСМеждуФиллиалами</name>
  <posting>Deny</posting>
  <attributes>
    <name>ОрганизацияИсточник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПриемник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписаниеОС</name>
    <type>
      <types>DocumentRef.СписаниеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВводОстатковОС</name>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПередачаОСМеждуФиллиалами</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредствоПриемник</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписаноНаЗатраты</name>
      <comment>(Общ)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписаноНаЗатратыБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКапитальныхВложенийВключаемыхВРасходыНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтражения</name>
      <type>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <comment>Выбирается из списка регистра сведений &quot;Работники организаций&quot;</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьПоБазовойСтоимостиНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереходаКРасчетуПоБазовойСтоимостиНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийСрокИспользованияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСостояния</name>
    <comment>Дата состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <comment>Основное средство</comment>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СостоянияОСОрганизаций/СостоянияОСОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОСОрганизаций</name>
  <comment>Состояния ОС организаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСостояния</name>
    <comment>Дата состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <comment>Основное средство</comment>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <comment>Состояние</comment>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СчетаБухгалтерскогоУчетаОС/СчетаБухгалтерскогоУчетаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаБухгалтерскогоУчетаОС</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СчетаНалоговогоУчетаОС/СчетаНалоговогоУчетаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаНалоговогоУчетаОС</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета амортизируемого имущества НУ</comment>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет учета амортизации НУ</comment>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПараметрыАмортизацииОС/ПараметрыАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыАмортизацииОС</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПараметрыАмортизацииОСНалоговыйУчет/ПараметрыАмортизацииОСНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыАмортизацииОСНалоговыйУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПРДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ПередачаОСМеждуФиллиалами/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ  ИНТЕРФЕЙС

Процедура СоздатьСписаниеОС(Ссылка, ДокументСписаниеОС) Экспорт
	
	ДокуметнОбъект = ДокументСписаниеОС.ПолучитьОбъект();
	ДокуметнОбъект.ОС.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_ПередачаОСМеждуФиллиалами.ОрганизацияИсточник КАК Организация,
	                      |	абс_ПередачаОСМеждуФиллиалами.СчетБУ КАК СчетСписанияБУ,
	                      |	абс_ПередачаОСМеждуФиллиалами.СчетНУ КАК СчетСписанияНУ,
	                      |	абс_ПередачаОСМеждуФиллиалами.Ответственный,
	                      |	абс_ПередачаОСМеждуФиллиалами.ПричинаСписания,
	                      |	абс_ПередачаОСМеждуФиллиалами.Событие,
	                      |	абс_ПередачаОСМеждуФиллиалами.Событие КАК СобытиеРегл,
	                      |	ИСТИНА КАК ОтражатьВБухгалтерскомУчете,
	                      |	ИСТИНА КАК ОтражатьВНалоговомУчете,
	                      |	ИСТИНА КАК ОтражатьВУправленческомУчете,
	                      |	ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами) КАК ВидОперации,
	                      |	абс_ПередачаОСМеждуФиллиалами.ОрганизацияПриемник КАК СубконтоБУ,
	                      |	абс_ПередачаОСМеждуФиллиалами.ОрганизацияПриемник КАК СубконтоНУ,
	                      |	абс_ПередачаОСМеждуФиллиалами.Дата
	                      |ИЗ
	                      |	Документ.абс_ПередачаОСМеждуФиллиалами КАК абс_ПередачаОСМеждуФиллиалами
	                      |ГДЕ
	                      |	абс_ПередачаОСМеждуФиллиалами.Ссылка = &Ссылка");
						  
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДокуметнОбъект, ВыборкаПоШапке);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_ПередачаОСМеждуФиллиаламиОС.НомерСтроки,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредствоПриемник,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Стоимость,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Амортизация,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияЗаМесяц,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СписаноНаЗатраты,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СтоимостьБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияЗаМесяцБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СписаноНаЗатратыБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СтоимостьНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияЗаМесяцНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СуммаКапитальныхВложенийВключаемыхВРасходыНУ
	               |ИЗ
	               |	Документ.абс_ПередачаОСМеждуФиллиалами.ОС КАК абс_ПередачаОСМеждуФиллиаламиОС
	               |ГДЕ
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка = &Ссылка";
				   
	ВыборкаПоТаблице = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоТаблице.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ДокуметнОбъект.ОС.Добавить(), ВыборкаПоТаблице);
	КонецЦикла;
	
	ДокуметнОбъект.ОбменДанными.Загрузка = Истина;
	ДокуметнОбъект.ПометкаУдаления = Ложь;
	ДокуметнОбъект.Записать();

КонецПроцедуры

Процедура СоздатьВводНачальныхОстатков(Ссылка, ДокументВводОстатковОС) Экспорт
	
	ДокуметнОбъект = ДокументВводОстатковОС.ПолучитьОбъект();
	ДокуметнОбъект.ОС.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_ПередачаОСМеждуФиллиалами.Ответственный,
	                      |	ИСТИНА КАК ОтражатьВБухгалтерскомУчете,
	                      |	ИСТИНА КАК ОтражатьВНалоговомУчете,
	                      |	ИСТИНА КАК ОтражатьВУправленческомУчете,
	                      |	ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийВводОстОС.ПоступлениеПоАвизо) КАК ВидОперации,
	                      |	абс_ПередачаОСМеждуФиллиалами.Дата,
	                      |	абс_ПередачаОСМеждуФиллиалами.ОрганизацияПриемник КАК Организация,
	                      |	абс_ПередачаОСМеждуФиллиалами.ПодразделениеОрганизации,
	                      |	абс_ПередачаОСМеждуФиллиалами.Подразделение
	                      |ИЗ
	                      |	Документ.абс_ПередачаОСМеждуФиллиалами КАК абс_ПередачаОСМеждуФиллиалами
	                      |ГДЕ
	                      |	абс_ПередачаОСМеждуФиллиалами.Ссылка = &Ссылка");
						  
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДокуметнОбъект, ВыборкаПоШапке);
	
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ПервоначальнуеНУ.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.ПустаяСсылка)
	//|			ТОГДА УчетнаяПолитика.МетодНачисленияАмортизацииНУ
	//|		ИНАЧЕ ПервоначальнуеНУ.МетодНачисленияАмортизации
	//|	КОНЕЦ КАК МетодНачисленияАмортизацииНУ,
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_ПередачаОСМеждуФиллиаламиОС.НомерСтроки,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредствоПриемник КАК ОсновноеСредствоПриемник,
	               |	СостоянияОС_Эксплутатация.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	               |	СостоянияОСОрганизаций__Эксплутатация.ДатаСостояния КАК ДатаВводаВЭксплуатациюРегл,
	               |	СостоянияОС_Принятие.ДатаСостояния КАК ДатаПринятияКУчету,
	               |	СостоянияОСОрганизаций_Принятие.ДатаСостояния КАК ДатаПринятияКУчетуРегл,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство КАК ОсновноеСредство,
	               |	&СобытиеПринятияКУчету,
	               |	&СобытиеПринятияКУчету КАК СобытиеПринятияКУчетуРегл,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Стоимость КАК ПервоначальнаяСтоимость,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СтоимостьБУ КАК ПервоначальнаяСтоимостьБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	               |	ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации) КАК ПорядокВключенияСтоимостиВСоставРасходовНУ,
	               |	СчетаБУ.СчетУчета КАК СчетУчетаБУ,
	               |	СчетаБУ.СчетНачисленияАмортизации КАК СчетАмортизацииБУ,
	               |	СчетаНУ.СчетУчета КАК СчетУчетаНУ,
	               |	СчетаНУ.СчетНачисленияАмортизации КАК СчетАмортизацииНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Амортизация КАК НакопленнаяАмортизация,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияБУ КАК НакопленнаяАмортизацияБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияНУ КАК СуммаНакопленнойАмортизацииНУ,
				   |	абс_ПередачаОСМеждуФиллиаламиОС.АмортизацияНУ КАК НакопленнаяАмортизацияНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ТекущаяСтоимость,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ТекущаяСтоимостьБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.ТекущаяСтоимостьНУ,
	               |	ПараметрыАмортизация.СрокПолезногоИспользования,
	               |	ПараметрыАмортизация.КоэффициентАмортизации,
	               |	ПараметрыАмортизация.КоэффициентУскорения,
	               |	ПараметрыАмортизацияБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияБУ,
	               |	ПараметрыАмортизацияБУ.КоэффициентАмортизации КАК КоэффициентАмортизацииБУ,
	               |	ПараметрыАмортизацияБУ.КоэффициентУскорения КАК КоэффициентУскоренияБУ,
	               |	ПараметрыАмортизацияНУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияНУ,
	               |	ПараметрыАмортизация.СтоимостьДляВычисленияАмортизации,
	               |	ПараметрыАмортизацияБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииБУ,
	               |	ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный) КАК МетодНачисленияАмортизацииНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СпособОтражения КАК СпособОтраженияРасходовПоАмортизации,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СпособОтражения КАК СпособОтраженияРасходовПоАмортизацииБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.СпособОтражения КАК СпособОтраженияРасходовПоАмортизацииНУ,
	               |	ПервоначальныеСведенияОС.СпособНачисленияАмортизации,
	               |	ПервоначальныеБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизацииБУ,
	               |	ПервоначальныеБУ.СпособПоступления КАК СпособПоступленияБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка.СчетБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка.СчетНУ,
	               |	ПараметрыАмортизацияНУ.СрокИспользованияДляВычисленияАмортизации КАК ФактическийСрокИспользованияНУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка.ОрганизацияИсточник КАК СубконтоБУ,
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка.ОрганизацияИсточник КАК СубконтоНУ,
	               |	ИСТИНА КАК НачислятьАмортизацию,
	               |	ИСТИНА КАК НачислятьАмортизациюБУ,
	               |	ИСТИНА КАК НачислятьАмортизациюНУ,
				   |	&СобытиеВводВЭксплуатацию КАК СобытиеВводВЭксплуатацию,
				   |	&СобытиеВводВЭксплуатацию КАК СобытиеВводВЭксплуатациюРегл
	               |ИЗ
	               |	Документ.абс_ПередачаОСМеждуФиллиалами.ОС КАК абс_ПередачаОСМеждуФиллиаламиОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК СостоянияОС_Эксплутатация
	               |		ПО (СостоянияОС_Эксплутатация.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))
	               |			И абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СостоянияОС_Эксплутатация.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций__Эксплутатация
	               |		ПО (СостоянияОСОрганизаций__Эксплутатация.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))
	               |			И абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СостоянияОСОрганизаций__Эксплутатация.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК СостоянияОС_Принятие
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СостоянияОС_Принятие.ОсновноеСредство
	               |			И (СостоянияОС_Принятие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций_Принятие
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СостоянияОСОрганизаций_Принятие.ОсновноеСредство
	               |			И (СостоянияОСОрганизаций_Принятие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних КАК СчетаБУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СчетаБУ.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаНалоговогоУчетаОС.СрезПоследних КАК СчетаНУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = СчетаНУ.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних КАК ПараметрыАмортизация
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПараметрыАмортизация.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних КАК ПараметрыАмортизацияБУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПараметрыАмортизацияБУ.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних КАК ПараметрыАмортизацияНУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПараметрыАмортизацияНУ.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних КАК ПервоначальнуеНУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПервоначальнуеНУ.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних КАК ПервоначальныеСведенияОС
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних КАК ПервоначальныеБУ
	               |		ПО абс_ПередачаОСМеждуФиллиаламиОС.ОсновноеСредство = ПервоначальныеБУ.ОсновноеСредство,
	               |	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(, Организация = &ОрганизацияПриемник) КАК УчетнаяПолитика
	               |ГДЕ
	               |	абс_ПередачаОСМеждуФиллиаламиОС.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("СобытиеПринятияКУчету", Справочники.СобытияОС.НайтиПоНаименованию("Принятие к учету"));
	Запрос.УстановитьПараметр("СобытиеВводВЭксплуатацию", Справочники.СобытияОС.НайтиПоНаименованию("Ввод в эксплуатацию"));
	Запрос.УстановитьПараметр("ОрганизацияПриемник", Ссылка.ОрганизацияПриемник);
	
	абс_Обособленное      = Ссылка.ПодразделениеОрганизации;
	ОрганизацияПолучатель = Ссылка.ОрганизацияПриемник;
		
	ВыборкаПоТаблице = Запрос.Выполнить().Выбрать();
	//МетодНачисленияАмортизацииНУ , ДатаПереходаКРасчетуПоБазовойСтоимостиНУ, ФактическийСрокИспользованияНУ
	Пока ВыборкаПоТаблице.Следующий() Цикл 
		НоваяСтрока = ДокуметнОбъект.ОС.Добавить();
		Сведения = УправлениеВнеоборотнымиАктивами.ПолучитьСведенияОбОС(ВыборкаПоТаблице.ОсновноеСредство, ВыборкаПоШапке.Дата);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Сведения);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТаблице);
		Если ЗначениеЗаполнено(ВыборкаПоТаблице.ОсновноеСредствоПриемник) Тогда 
			НоваяСтрока.ОсновноеСредство = ВыборкаПоТаблице.ОсновноеСредствоПриемник;
		Иначе
			НоваяСтрока.ОсновноеСредство = абс_БизнесПроцессыПривелегированный.ПолучитьОСПриемник(ВыборкаПоТаблице.ОсновноеСредство,,ВыборкаПоШапке.абс_ОбособленноеПодразделение, ВыборкаПоШапке.ОрганизацияПриемник);
		КонецЕсли;
		НоваяСтрока.ИнвентарныйНомерРегл = НоваяСтрока.ОсновноеСредство.Код;
		НоваяСтрока.МОЛРегл = НоваяСтрока.МОЛ;
	КонецЦикла;
	
	ДокуметнОбъект.ОбменДанными.Загрузка = Истина;
	ДокуметнОбъект.ПометкаУдаления = Ложь;
	ДокуметнОбъект.Записать();
		
КонецПроцедуры

//Функция ПолучитьОСПриемник(ОСИсточник, ОСПриемник = Неопределено) Экспорт
//	
//	Если ЗначениеЗаполнено(ОСПриемник) Тогда 
//		Возврат ОСПриемник;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос("Выбрать т.Ссылка из Справочник.ОсновныеСредства как т где т.абс_ОсновноеСредствоИсточник = &ОС");
//	Запрос.УстановитьПараметр("ОС", ОСИсточник);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда  
//		Возврат Выборка.Ссылка;
//	КонецЕсли;
//	
//	ОСПриемникОбъект = ОСИсточник.Скопировать(); 
//	ОСПриемникОбъект.Код = ОСИсточник.Код;
//	ОСПриемникОбъект.абс_ОсновноеСредствоИсточник = ОСИсточник;
//	ОСПриемникОбъект.Записать();
//	
//	Возврат ОСПриемникОбъект.Ссылка; 
//		
//КонецФункции

Функция НайтиОСПриемник(ОСИсточник, ОСПриемник = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ОСПриемник) Тогда 
		Возврат ОСПриемник;
	КонецЕсли;
	
	Запрос = Новый Запрос("Выбрать т.Ссылка из Справочник.ОсновныеСредства как т где т.абс_ОсновноеСредствоИсточник = &ОС");
	Запрос.УстановитьПараметр("ОС", ОСИсточник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ОСПриемник; 
	
КонецФункции

Процедура СоздатьПустыеДокументы(ДокументВводОстатковОС, ДокументСписаниеОС, ОрганизацияИсточник, ОрганизацияПриемник, Дата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСписаниеОС) Тогда 
		ДокуметнОбъект = Документы.СписаниеОС.СоздатьДокумент();
		ДокуметнОбъект.Дата = Дата;
		ДокуметнОбъект.Организация = ОрганизацияИсточник;
		ДокуметнОбъект.УстановитьНовыйНомер();
		ДокуметнОбъект.ОбменДанными.Загрузка = Истина;
		ДокуметнОбъект.Записать();
		ДокументСписаниеОС = ДокуметнОбъект.Ссылка;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументВводОстатковОС) Тогда 
		ДокуметнОбъект = Документы.ВводНачальныхОстатковОС.СоздатьДокумент();
		ДокуметнОбъект.Дата = Дата;
		ДокуметнОбъект.Организация = ОрганизацияПриемник;
		ДокуметнОбъект.УстановитьНовыйНомер();
	 	ДокуметнОбъект.ОбменДанными.Загрузка = Истина;
		ДокуметнОбъект.Записать();
		ДокументВводОстатковОС = ДокуметнОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдаление(ДокументВводОстатковОС, ДокументСписаниеОС) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСписаниеОС) Тогда 
		ДокуметнОбъект = ДокументСписаниеОС.ПолучитьОбъект();
		ДокуметнОбъект.ПометкаУдаления = Истина;
		ДокуметнОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументВводОстатковОС) Тогда 
		ДокуметнОбъект = ДокументВводОстатковОС.ПолучитьОбъект();
		ДокуметнОбъект.ПометкаУдаления = Истина;
		ДокуметнОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
КонецПроцедуры
